
#Область Главная

// TODO исправить выполнение кода
Функция ПроверкаСвязиОтветИстина(Запрос)

	ТекстОтвета = Новый Структура;
	ТекстОтвета.Вставить("data", "Александр созванивается с Анатолием в 11:00");

	Ответ = Новый HTTPСервисОтвет(200);
	Ответ.УстановитьТелоИзСтроки(ПолучитьJSONИзСтруктуры(ТекстОтвета));

	Возврат Ответ;

КонецФункции

	
#КонецОбласти

#Область Аааа

// Выгружает данные контрагентов в массив структур.
//
// Параметры:
//  ОтборПоОрганизации - СправочникСсылка.Организации - (необязательный) отбор; не используется в MVP.
//
// Возвращаемое значение:
//  Массив - массив структур с ключами GUID, ИНН, КПП, Наименование.
//
Функция ВыгрузитьКонтрагентов() Экспорт

	// TODO Исправить выполнение кода запроса
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|    Контрагенты.Ссылка КАК Ссылка,
	|    Контрагенты.ИНН КАК ИНН,
	|    Контрагенты.КПП КАК КПП,
	|    Контрагенты.Наименование КАК Наименование
	|ИЗ
	|    Справочник.Контрагенты КАК Контрагенты
	|ГДЕ
	|    Контрагенты.ЭтоГруппа = ЛОЖЬ
	|    И НЕ Контрагенты.ПометкаУдаления";

	Результат = Новый Массив;
	// FIXME исправить выполнение запроса
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл

		ДанныеКонтрагента = Новый Структура;
		
		ДанныеКонтрагента.Вставить("GUID", Строка(Выборка.Ссылка.УникальныйИдентификатор()));
		ДанныеКонтрагента.Вставить("ИНН", Выборка.ИНН);
		ДанныеКонтрагента.Вставить("КПП", Выборка.КПП);
		ДанныеКонтрагента.Вставить("Наименование", Выборка.Наименование);

		Результат.Добавить(ДанныеКонтрагента);

	КонецЦикла;

	Возврат Результат;

КонецФункции

// Выгружает данные контрагентов в массив структур.
//
// Параметры:
//  ОтборПоОрганизации - СправочникСсылка.Организации - (необязательный) отбор; не используется в MVP.
//
// Возвращаемое значение:
//  Массив - массив структур с ключами GUID, ИНН, КПП, Наименование.
//
Функция ВыгрузитьНоменклатуру() Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Номенклатура.Ссылка КАК Ссылка,
	|	Номенклатура.Родитель КАК Родитель,
	|	Номенклатура.Артикул КАК Артикул,
	|	Номенклатура.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	Номенклатура.НаименованиеПолное КАК НаименованиеПолное,
	|	Номенклатура.ВидСтавкиНДС КАК ВидСтавкиНДС,
	|	Номенклатура.ТипНоменклатуры КАК ТипНоменклатуры,
	|	Номенклатура.КатегорияНоменклатуры КАК КатегорияНоменклатуры
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура";

	Результат = Новый Массив;
	// FIXME исправить выполнение запроса
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл

		ДанныеКонтрагента = Новый Структура;
		
		ДанныеКонтрагента.Вставить("GUID", Строка(Выборка.Ссылка.УникальныйИдентификатор()));
		ДанныеКонтрагента.Вставить("Артикул", Выборка.Артикул);
		ДанныеКонтрагента.Вставить("ЕдиницаИзмерения", Строка(Выборка.ЕдиницаИзмерения));
		ДанныеКонтрагента.Вставить("НаименованиеПолное", Выборка.НаименованиеПолное);

		Результат.Добавить(ДанныеКонтрагента);

	КонецЦикла;

	Возврат Результат;

КонецФункции

// Формирует JSON строку для отправки данных в ответ HTTP сервису
//
// Параметры:
//  Структура	- Структура - Структура которая переделывается в строку JSON
// 
// Возвращаемое значение:
//  СтрокаJSON	- Строка в формате JSON
//
Функция ПолучитьJSONИзСтруктуры(Структура)
	
	СтрокаJSON = Новый ЗаписьJSON;
	СтрокаJSON.УстановитьСтроку();
	
	ЗаписатьJSON(СтрокаJSON, Структура); 
	
	ТелоJSON = СтрокаJSON.Закрыть();
	
	Возврат ТелоJSON;
	
КонецФункции

#КонецОбласти


