
Функция ПроверкаСвязиОтветИстина(Запрос)
	
	ТекстОтвета = Новый Структура;
	ТекстОтвета.Вставить("data", "Александр созванивается с Анатолием в 11:00");
	
	Ответ = Новый HTTPСервисОтвет(200);
	Ответ.УстановитьТелоИзСтроки(ПолучитьJSONИзСтруктуры(ТекстОтвета));
	
	Возврат Ответ;
	
КонецФункции

// Формирует JSON строку для отправки данных в ответ HTTP сервису
//
// Параметры:
//  Структура	- Структура - Структура которая переделывается в строку JSON
// 
// Возвращаемое значение:
//  СтрокаJSON	- Строка в формате JSON
//
Функция ПолучитьJSONИзСтруктуры(Структура)
	
	СтрокаJSON = Новый ЗаписьJSON;
	СтрокаJSON.УстановитьСтроку();
	
	ЗаписатьJSON(СтрокаJSON, Структура); 
	
	ТелоJSON = СтрокаJSON.Закрыть();
	
	Возврат ТелоJSON;
	
КонецФункции
