
#Область ОбработчикиСобытийФормы

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыЗапасы

&НаКлиенте
Процедура ЗапасыКоличествоПриИзменении(Элемент)
	РассчитатьСуммуЗапасов();
КонецПроцедуры

&НаКлиенте
Процедура ЗапасыЦенаПриИзменении(Элемент)
	РассчитатьСуммуЗапасов();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Комментарий для проверки синхронизации

&НаКлиенте
Процедура РассчитатьСуммуЗапасов()

	ТекущиеДанные = Элементы.Запасы.ТекущиеДанные;

	Если ТипЗнч(ТекущиеДанные.Цена) = Тип("Число")
		И ТипЗнч(ТекущиеДанные.Количество) = Тип("Число") Тогда

		ТекущиеДанные.Сумма = ТекущиеДанные.Цена * ТекущиеДанные.Количество;

	Иначе

		ТекущиеДанные.Сумма = 0;

	КонецЕсли;

КонецПроцедуры

#КонецОбласти
